In [ ]:
(graphic visualization by yourself)
matplotlib pyplot 
epa
use matplotlib on titanic data
unstack to reverse groupby --> converts index back to column

In [ ]:
str obj dtypes take lots of time for merge
while int or num take seconds for merge function

In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [8]:
string = pd.Series(["aisha", "hello", "hi", np.nan])
string

0    aisha
1    hello
2       hi
3      NaN
dtype: object

In [10]:
string.isnull()

0    False
1    False
2    False
3     True
dtype: bool

In [11]:
string.notnull()

0     True
1     True
2     True
3    False
dtype: bool

In [12]:
string.isnull()

0    False
1    False
2    False
3     True
dtype: bool

In [13]:
string.isna()

0    False
1    False
2    False
3     True
dtype: bool

In [14]:
string.notna()

0     True
1     True
2     True
3    False
dtype: bool

In [16]:
print(string)
string[~string.isnull]
string[~string.isna]

0    aisha
1    hello
2       hi
3      NaN
dtype: object

TypeError: bad operand type for unary ~: 'method'

In [17]:
string.duplicated()

0    False
1    False
2    False
3    False
dtype: bool

In [18]:
string.dropna() #delete row having none

0    aisha
1    hello
2       hi
dtype: object

# filtering out missing data

In [19]:
string[string.notnull()]

0    aisha
1    hello
2       hi
dtype: object

In [24]:
data = pd.DataFrame([[1., 6.5, 3.], [1., np.nan, np.nan],[np.nan, np.nan, np.nan], [np.nan, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [27]:
cleaned = data.dropna() #any delete rows having any blank data
cleaned

     0    1    2
0  1.0  6.5  3.0

In [28]:
cleaned = data.dropna(how = "all") #all delete only rows having all blank data
cleaned

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [29]:
data[4] = np.nan
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [30]:
data.dropna(axis=1, how="all") #col drop

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [31]:
data.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [33]:
df = pd.DataFrame(np.random.randn(7,3))
df.iloc[:4,1] = np.nan
df.iloc[:2,2] = np.nan
df

          0         1         2
0  0.028820       NaN       NaN
1  0.010354       NaN       NaN
2  0.505086       NaN  0.253571
3 -1.359602       NaN -1.704903
4 -1.349993  1.173253  1.233467
5  1.711610 -0.399452  0.814710
6  0.220690 -0.494937 -1.095809

In [36]:
print(df)
df.dropna()

          0         1         2
0  0.028820       NaN       NaN
1  0.010354       NaN       NaN
2  0.505086       NaN  0.253571
3 -1.359602       NaN -1.704903
4 -1.349993  1.173253  1.233467
5  1.711610 -0.399452  0.814710
6  0.220690 -0.494937 -1.095809

          0         1         2
4 -1.349993  1.173253  1.233467
5  1.711610 -0.399452  0.814710
6  0.220690 -0.494937 -1.095809

In [37]:
print(df)
df.dropna(thresh=2) #row having atleast 2 missing values

          0         1         2
0  0.028820       NaN       NaN
1  0.010354       NaN       NaN
2  0.505086       NaN  0.253571
3 -1.359602       NaN -1.704903
4 -1.349993  1.173253  1.233467
5  1.711610 -0.399452  0.814710
6  0.220690 -0.494937 -1.095809

          0         1         2
2  0.505086       NaN  0.253571
3 -1.359602       NaN -1.704903
4 -1.349993  1.173253  1.233467
5  1.711610 -0.399452  0.814710
6  0.220690 -0.494937 -1.095809

In [40]:
df[(df[1].notnull())] #omit notnull rows

          0         1         2
4 -1.349993  1.173253  1.233467
5  1.711610 -0.399452  0.814710
6  0.220690 -0.494937 -1.095809

In [41]:
df[1]

0         NaN
1         NaN
2         NaN
3         NaN
4    1.173253
5   -0.399452
6   -0.494937
Name: 1, dtype: float64

# filling in missing data
drop or fill by mean, meadian, mode,0

In [43]:
print(df)
df.fillna(0)

          0         1         2
0  0.028820       NaN       NaN
1  0.010354       NaN       NaN
2  0.505086       NaN  0.253571
3 -1.359602       NaN -1.704903
4 -1.349993  1.173253  1.233467
5  1.711610 -0.399452  0.814710
6  0.220690 -0.494937 -1.095809

          0         1         2
0  0.028820  0.000000  0.000000
1  0.010354  0.000000  0.000000
2  0.505086  0.000000  0.253571
3 -1.359602  0.000000 -1.704903
4 -1.349993  1.173253  1.233467
5  1.711610 -0.399452  0.814710
6  0.220690 -0.494937 -1.095809

In [46]:
df.fillna({1:5, 2:7}) #col1 nan replaced by 5, col2 nan replaced by 7

          0         1         2
0  0.028820  5.000000  7.000000
1  0.010354  5.000000  7.000000
2  0.505086  5.000000  0.253571
3 -1.359602  5.000000 -1.704903
4 -1.349993  1.173253  1.233467
5  1.711610 -0.399452  0.814710
6  0.220690 -0.494937 -1.095809

In [48]:
df.mean()

0   -0.033291
1    0.092955
2   -0.099793
dtype: float64

In [49]:
df.fillna(df.mean()) #inline

          0         1         2
0  0.028820  0.092955 -0.099793
1  0.010354  0.092955 -0.099793
2  0.505086  0.092955  0.253571
3 -1.359602  0.092955 -1.704903
4 -1.349993  1.173253  1.233467
5  1.711610 -0.399452  0.814710
6  0.220690 -0.494937 -1.095809

In [50]:
df

          0         1         2
0  0.028820       NaN       NaN
1  0.010354       NaN       NaN
2  0.505086       NaN  0.253571
3 -1.359602       NaN -1.704903
4 -1.349993  1.173253  1.233467
5  1.711610 -0.399452  0.814710
6  0.220690 -0.494937 -1.095809

In [51]:
df.fillna(df.mean(), inplace=True) #in memory. change physical data

In [52]:
df

          0         1         2
0  0.028820  0.092955 -0.099793
1  0.010354  0.092955 -0.099793
2  0.505086  0.092955  0.253571
3 -1.359602  0.092955 -1.704903
4 -1.349993  1.173253  1.233467
5  1.711610 -0.399452  0.814710
6  0.220690 -0.494937 -1.095809

In [57]:
df = pd.DataFrame(np.random.randn(6,3))
df.iloc[2:-1,1] = np.nan
df.iloc[4: 2] = np.nan

df

          0         1         2
0 -0.580313  1.232358 -2.183981
1  0.690586 -1.691387 -1.269550
2 -2.387923       NaN -0.684656
3  1.901705       NaN  0.992118
4 -0.439738       NaN -0.500998
5  0.449447  1.402464 -0.389395

In [55]:
print(df)
df.fillna(method="ffill") #forwardfill up to down axis= 0

          0         1         2
0 -0.439610 -1.123660 -0.768961
1  0.799246 -0.848457  0.264147
2  0.252422       NaN -0.976466
3 -0.088885       NaN  0.426751
4 -0.412413       NaN -0.417763
5  0.178278 -0.104461 -1.788529

          0         1         2
0 -0.439610 -1.123660 -0.768961
1  0.799246 -0.848457  0.264147
2  0.252422 -0.848457 -0.976466
3 -0.088885 -0.848457  0.426751
4 -0.412413 -0.848457 -0.417763
5  0.178278 -0.104461 -1.788529

In [58]:
print(df)
df.fillna(method="ffill", axis=1) #forwardfill up to down axis= 0

          0         1         2
0 -0.580313  1.232358 -2.183981
1  0.690586 -1.691387 -1.269550
2 -2.387923       NaN -0.684656
3  1.901705       NaN  0.992118
4 -0.439738       NaN -0.500998
5  0.449447  1.402464 -0.389395

          0         1         2
0 -0.580313  1.232358 -2.183981
1  0.690586 -1.691387 -1.269550
2 -2.387923 -2.387923 -0.684656
3  1.901705  1.901705  0.992118
4 -0.439738 -0.439738 -0.500998
5  0.449447  1.402464 -0.389395

In [63]:
print(df)
df.fillna(method="bfill", limit=2)#backward fill

          0         1         2
0 -0.580313  1.232358 -2.183981
1  0.690586 -1.691387 -1.269550
2 -2.387923       NaN -0.684656
3  1.901705       NaN  0.992118
4 -0.439738       NaN -0.500998
5  0.449447  1.402464 -0.389395

          0         1         2
0 -0.580313  1.232358 -2.183981
1  0.690586 -1.691387 -1.269550
2 -2.387923       NaN -0.684656
3  1.901705  1.402464  0.992118
4 -0.439738  1.402464 -0.500998
5  0.449447  1.402464 -0.389395

In [62]:
print(df)
df.fillna(method="bfill", axis = 1)

          0         1         2
0 -0.580313  1.232358 -2.183981
1  0.690586 -1.691387 -1.269550
2 -2.387923       NaN -0.684656
3  1.901705       NaN  0.992118
4 -0.439738       NaN -0.500998
5  0.449447  1.402464 -0.389395

          0         1         2
0 -0.580313  1.232358 -2.183981
1  0.690586 -1.691387 -1.269550
2 -2.387923 -0.684656 -0.684656
3  1.901705  0.992118  0.992118
4 -0.439738 -0.500998 -0.500998
5  0.449447  1.402464 -0.389395

In [65]:
#how many null values
df = pd.DataFrame(np.random.randn(6,3))
df.iloc[2:-1,1] = np.nan
df.iloc[4: 2] = np.nan

df

          0         1         2
0 -0.905359  0.783244  1.135957
1  0.756768 -0.549546 -0.017336
2 -1.200811       NaN  1.037521
3  1.078814       NaN  0.051169
4 -0.981760       NaN -0.094181
5 -1.092710  1.292800  0.245240

In [67]:
df[2]isna()

SyntaxError: invalid syntax (<ipython-input-67-dae56820b50f>, line 1)

# data transformation
## removing duplicates

In [68]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'], 'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [69]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [70]:
data[data.duplicated()]

    k1  k2
6  two   4

In [71]:
data[~data.duplicated()]

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [72]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [ ]:
ltd launch to day
ytd year to day
mtd month to day
wtd week to day

In [73]:
data.drop_duplicates(subset="k1")

    k1  k2
0  one   1
1  two   1

In [74]:
data.drop_duplicates(subset=["k1","k2"])

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [76]:
data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [77]:
data.drop_duplicates(["k1","k2"], keep="last")

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [78]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 'Pastrami', 'corned beef', 'Bacon','pastrami', 'honey ham', 'nova lox'], 'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [79]:
meettoanimal = {'food': ['bacon', 'pulled pork', 'bacon', 'Pastrami', 'corned beef', 'Bacon','pastrami', 'honey ham', 'nova lox'],
                'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]}
meettoanimal

{'food': ['bacon',
  'pulled pork',
  'bacon',
  'Pastrami',
  'corned beef',
  'Bacon',
  'pastrami',
  'honey ham',
  'nova lox'],
 'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]}

In [ ]:
data

# replacing values

In [82]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [85]:
data.replace(-999,np.nan) #inline

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [86]:
data.replace([-999, -1000],np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [87]:
data.replace([-999, -1000],[np.nan,0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

# Renaming Axis Indexes

In [88]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)), 
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [89]:
transform = lambda x: x[:4].upper()

In [90]:
data.index.map(transform) #inline

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [91]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [92]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [94]:
data.rename(index=str.title, columns=str.upper) #inline

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [95]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [96]:
data.rename(index= {'OHIO': 'INDIANA'},
            columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [97]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

# Discretization and Binning

In [98]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [99]:
bins = [18, 25, 35, 60, 100]

In [102]:
cat = pd.cut(ages, bins)
cat

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [107]:
cat.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [108]:
cat.categories # ] shows this side is closed ->inclusive

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [109]:
pd.value_counts(cat)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [110]:
pd.cut(ages,bins, right=False) #right open ->exclusive

[[18, 25), [18, 25), [25, 35), [25, 35), [18, 25), ..., [25, 35), [60, 100), [35, 60), [35, 60), [25, 35)]
Length: 12
Categories (4, interval[int64]): [[18, 25) < [25, 35) < [35, 60) < [60, 100)]

* naming categories

In [113]:
groups = ["youth", "youngadult", "middleaged", "senior"]
pd.cut(ages, bins, labels = groups)

[youth, youth, youth, youngadult, youth, ..., youngadult, senior, middleaged, middleaged, youngadult]
Length: 12
Categories (4, object): [youth < youngadult < middleaged < senior]

In [115]:
pd.cut(ages,4, precision=2) #precision limits decimal precision

[(19.96, 30.25], (19.96, 30.25], (19.96, 30.25], (19.96, 30.25], (19.96, 30.25], ..., (30.25, 40.5], (50.75, 61.0], (40.5, 50.75], (40.5, 50.75], (30.25, 40.5]]
Length: 12
Categories (4, interval[float64]): [(19.96, 30.25] < (30.25, 40.5] < (40.5, 50.75] < (50.75, 61.0]]

In [137]:
d = np.arange(100,800)
pd.qcut(d,4)
d

array([100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112,
       113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125,
       126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138,
       139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149, 150, 151,
       152, 153, 154, 155, 156, 157, 158, 159, 160, 161, 162, 163, 164,
       165, 166, 167, 168, 169, 170, 171, 172, 173, 174, 175, 176, 177,
       178, 179, 180, 181, 182, 183, 184, 185, 186, 187, 188, 189, 190,
       191, 192, 193, 194, 195, 196, 197, 198, 199, 200, 201, 202, 203,
       204, 205, 206, 207, 208, 209, 210, 211, 212, 213, 214, 215, 216,
       217, 218, 219, 220, 221, 222, 223, 224, 225, 226, 227, 228, 229,
       230, 231, 232, 233, 234, 235, 236, 237, 238, 239, 240, 241, 242,
       243, 244, 245, 246, 247, 248, 249, 250, 251, 252, 253, 254, 255,
       256, 257, 258, 259, 260, 261, 262, 263, 264, 265, 266, 267, 268,
       269, 270, 271, 272, 273, 274, 275, 276, 277, 278, 279, 280, 281,
       282, 283, 284, 285, 286, 287, 288, 289, 290, 291, 292, 293, 294,
       295, 296, 297, 298, 299, 300, 301, 302, 303, 304, 305, 306, 307,
       308, 309, 310, 311, 312, 313, 314, 315, 316, 317, 318, 319, 320,
       321, 322, 323, 324, 325, 326, 327, 328, 329, 330, 331, 332, 333,
       334, 335, 336, 337, 338, 339, 340, 341, 342, 343, 344, 345, 346,
       347, 348, 349, 350, 351, 352, 353, 354, 355, 356, 357, 358, 359,
       360, 361, 362, 363, 364, 365, 366, 367, 368, 369, 370, 371, 372,
       373, 374, 375, 376, 377, 378, 379, 380, 381, 382, 383, 384, 385,
       386, 387, 388, 389, 390, 391, 392, 393, 394, 395, 396, 397, 398,
       399, 400, 401, 402, 403, 404, 405, 406, 407, 408, 409, 410, 411,
       412, 413, 414, 415, 416, 417, 418, 419, 420, 421, 422, 423, 424,
       425, 426, 427, 428, 429, 430, 431, 432, 433, 434, 435, 436, 437,
       438, 439, 440, 441, 442, 443, 444, 445, 446, 447, 448, 449, 450,
       451, 452, 453, 454, 455, 456, 457, 458, 459, 460, 461, 462, 463,
       464, 465, 466, 467, 468, 469, 470, 471, 472, 473, 474, 475, 476,
       477, 478, 479, 480, 481, 482, 483, 484, 485, 486, 487, 488, 489,
       490, 491, 492, 493, 494, 495, 496, 497, 498, 499, 500, 501, 502,
       503, 504, 505, 506, 507, 508, 509, 510, 511, 512, 513, 514, 515,
       516, 517, 518, 519, 520, 521, 522, 523, 524, 525, 526, 527, 528,
       529, 530, 531, 532, 533, 534, 535, 536, 537, 538, 539, 540, 541,
       542, 543, 544, 545, 546, 547, 548, 549, 550, 551, 552, 553, 554,
       555, 556, 557, 558, 559, 560, 561, 562, 563, 564, 565, 566, 567,
       568, 569, 570, 571, 572, 573, 574, 575, 576, 577, 578, 579, 580,
       581, 582, 583, 584, 585, 586, 587, 588, 589, 590, 591, 592, 593,
       594, 595, 596, 597, 598, 599, 600, 601, 602, 603, 604, 605, 606,
       607, 608, 609, 610, 611, 612, 613, 614, 615, 616, 617, 618, 619,
       620, 621, 622, 623, 624, 625, 626, 627, 628, 629, 630, 631, 632,
       633, 634, 635, 636, 637, 638, 639, 640, 641, 642, 643, 644, 645,
       646, 647, 648, 649, 650, 651, 652, 653, 654, 655, 656, 657, 658,
       659, 660, 661, 662, 663, 664, 665, 666, 667, 668, 669, 670, 671,
       672, 673, 674, 675, 676, 677, 678, 679, 680, 681, 682, 683, 684,
       685, 686, 687, 688, 689, 690, 691, 692, 693, 694, 695, 696, 697,
       698, 699, 700, 701, 702, 703, 704, 705, 706, 707, 708, 709, 710,
       711, 712, 713, 714, 715, 716, 717, 718, 719, 720, 721, 722, 723,
       724, 725, 726, 727, 728, 729, 730, 731, 732, 733, 734, 735, 736,
       737, 738, 739, 740, 741, 742, 743, 744, 745, 746, 747, 748, 749,
       750, 751, 752, 753, 754, 755, 756, 757, 758, 759, 760, 761, 762,
       763, 764, 765, 766, 767, 768, 769, 770, 771, 772, 773, 774, 775,
       776, 777, 778, 779, 780, 781, 782, 783, 784, 785, 786, 787, 788,
       789, 790, 791, 792, 793, 794, 795, 796, 797, 798, 799])

# Detecting and Filtering Outliers